Repository: MiguelFerrer99/FirebaseLogin
Catalog: UltimateLogIn/Extras/*.lproj/Localizable.strings
Languages: es

source: Log In
es: Iniciar Sesión

# o
source: Or
es: O

# continue_email
source: Continue with email
es: Continuar con email

# pass
source: Password
es: Contraseña

# confirm_pass
source: Confirm password
es: Confirmar contraseña

source: Email
es: Correo electrónico

source: Remind user
es: Recordar usuario

# go_sign_up
source: Don't have an account? Sign up
es: No tienes una cuenta? Regístrate

# forgot_pass
source: Forgot your password?
es: Olvidaste tu contraseña?

source: Firstname
es: Nombre

source: Lastname
es: Apellidos

source: Cancel
es: Cancelar

source: Sign Up
es: Registrarse

# have_account
source: Already have an account?
es: Ya tienes una cuenta?

source: Reset password
es: Retablecer contraseña

# remember_password
source: Already remember your password?
es: Ya recuerdas tu contraseña?

source: Log Out
es: Cerrar Sesión

# login_error_title
source: Authentication failure
es: Fallo de autenticación

# email_not_verified_login_error_message
source: Your email has not been verified yet. Please verify it before Logging In
es: Tu email no ha sido verificado aún. Porfavor verifícalo antes de Iniciar Sesión

# google_login_error_message
source: The Google Sign In flow was canceled
es: El Inicio de Sesión con Google fue cancelado

# unexpected_error_message
source: An unexpected error occurred
es: Ha ocurrido un error inesperado

# email_used_error_message
source: This email is already used by other account
es: Este email ya está usado por otra cuenta

# registration_failure_title
source: Registration failure
es: Fallo de registro

# registration_completed_title
source: Registration completed succesfully
es: Registro completado exitosamente

# registration_completed_message
source: Please go back and verify your email before Logging In into your new account
es: Por favor vuelve atrás y verifica tu email antes de Iniciar Sesión en tu nueva cuenta

# different_passwords_message
source: Passwords must be equal
es: Las contraseñas deben ser iguales

# uploading_to_firestore_error_message
source: Error saving user data to Firestore. Please try again
es: Error guardando los datos en Firestore. Por favor inténtalo de nuevo

# uploading_to_storage_error_message
source: Error saving user data to Storage. Please try again
es: Error guardando los datos en Storage. Por favor inténtalo de nuevo

# verification_email_not_sended_message
source: An error occurred. The verification email could not be sent to your address email
es: Ha ocurrido un error. El email de verificación no pudo ser enviado a tu correo

# reset_password_error_title
source: Reset Password Failure
es: Fallo del restablecimiento de contraseña

# reset_password_success_title
source: Now you can reset your password
es: Ya puedes restablecer tu contraseña

# reset_password_success_message
source: We have just sent you an email to reset your password
es: Acabamos de enviarte un email para restablecer tu contraseña

# firestore_error_title
source: Firebase Error
es: Error de Firebase

# getting_from_firestore_error_message
source: Error getting user data from Firestore. Please try again
es: Error obteniendo los datos del usuario de Firestore. Por favor inténtelo de nuevo

# getting_from_storage_error_message
source: Error getting user data from Storage. Please try again
es: Error obteniendo los datos del usuario de Storage. Por favor inténtelo de nuevo

# network_error_message
source: A network error has occurred
es: Ha ocurrido un error de conexión

# email_badly_formatted_message
source: Email address format is not valid
es: El formato de la dirección de email no es válido

# password_format_error_message
source: Password must be 6 characters long or more
es: La contraseña debe tener 6 o más carácteres

# user_not_exists_error_message
source: There is no user with this email and password
es: No existe un usuario que se corresponda con este email y contraseña
